---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Location
source: html/b85eed72-6a01-6456-5da3-f4d55af11aec.htm
---
# Location Members

Causes the object to release immediately any resources it may be utilizing.